#include <stdio.h>
//จงเขียนโปรแกรมรับตัวเลข 1 ตัวแล้วให้คอมพิวเตอร์วาดรูปเครื่องหมาย * เป็นกรอบสี่เหลี่ยมที่มีด้านเท่ากับตัวเลขที่รับเข้ามา ดังตัวอย่าง (Level 2)
int main()
{
    int a, y, x;
    scanf("%d", &a);
    for (y = 1; y <= a; y++)
    {
        for (x = 1; x <= a; x++)
        {
            if ((y == 1 && x <= a) || (x == 1 && y <= a) || (x == a && y <= a) || (y == a && x <= a) && !((y != 1 && y != a && x != 1 && x != a)))
            {
                printf("*");
            }
            else
            {
                printf(" ");
            }
        }
        printf("\n");
    }
    return 0;
}